Revit 2027 API
IPrintSetting Interface
An interface which represents the Print Setup (Application Menu->Print->Print Setup) within Autodesk Revit.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public interface IPrintSetting
Public Interface IPrintSetting
public interface class IPrintSetting
type IPrintSetting = interface end
The IPrintSetting type exposes the following members.
Properties
Name | Description
PrintParameters | Returns the Parameters of Print Setup.
Top
See Also
Reference
Autodesk.Revit.DB Namespace